<template>
    <h1>fl-button for vue2</h1>
  <fl-button
    :type="type"
  ></fl-button>
</template>
<script>
import './index';

export default {
  components:{},
  props: {},
  data() {
    return {
      type: 'danger'
    }
  },
  mounted() {
    
  },
  methods: {
    // ==================================== 一、逻辑类 ====================================

    // ==================================== 二、数据请求类 ================================

    // ==================================== 三、跳转类 ====================================

    // ==================================== 四、小工具类 ==================================
  },
}
</script>
<style lang="scss" scoped>

</style>